vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/devices/MCXA156/periph1/PERI_SCG.h
/*! @name FIRCATC3 - FIRC Auto-trimming Counter 3 */
/*! @{ */

#define SCG_FIRCATC3_FINEMINC_SOSC_MASK          (0xFFFFU)
#define SCG_FIRCATC3_FINEMINC_SOSC_SHIFT         (0U)
/*! FINEMINC_SOSC - Fine Trim Minimum Counter SOSC */
#define SCG_FIRCATC3_FINEMINC_SOSC(x)            (((uint32_t)(((uint32_t)(x)) << SCG_FIRCATC3_FINEMINC_SOSC_SHIFT)) & SCG_FIRCATC3_FINEMINC_SOSC_MASK)

#define SCG_FIRCATC3_FINEMAXC_SOSC_MASK          (0xFFFF0000U)
#define SCG_FIRCATC3_FINEMAXC_SOSC_SHIFT         (16U)
/*! FINEMAXC_SOSC - Fine Trim Maximum Counter SOSC */
#define SCG_FIRCATC3_FINEMAXC_SOSC(x)            (((uint32_t)(((uint32_t)(x)) << SCG_FIRCATC3_FINEMAXC_SOSC_SHIFT)) & SCG_FIRCATC3_FINEMAXC_SOSC_MASK)
/*! @} */

/*! @name FIRCATC4 - FIRC Auto-trimming Counter 4 */
/*! @{ */

#define SCG_FIRCATC4_IDEALC_ROSC_MASK            (0xFFFFU)
#define SCG_FIRCATC4_IDEALC_ROSC_SHIFT           (0U)
/*! IDEALC_ROSC - Ideal Counter ROSC */
#define SCG_FIRCATC4_IDEALC_ROSC(x)              (((uint32_t)(((uint32_t)(x)) << SCG_FIRCATC4_IDEALC_ROSC_SHIFT)) & SCG_FIRCATC4_IDEALC_ROSC_MASK)

#define SCG_FIRCATC4_SETCYC_ROSC_MASK            (0xFF0000U)
#define SCG_FIRCATC4_SETCYC_ROSC_SHIFT           (16U)
/*! SETCYC_ROSC - Setup Cycle ROSC */
#define SCG_FIRCATC4_SETCYC_ROSC(x)              (((uint32_t)(((uint32_t)(x)) << SCG_FIRCATC4_SETCYC_ROSC_SHIFT)) & SCG_FIRCATC4_SETCYC_ROSC_MASK)

#define SCG_FIRCATC4_SAMCYC_ROSC_MASK            (0xFF000000U)
#define SCG_FIRCATC4_SAMCYC_ROSC_SHIFT           (24U)
/*! SAMCYC_ROSC - Sample Cycle ROSC */
#define SCG_FIRCATC4_SAMCYC_ROSC(x)              (((uint32_t)(((uint32_t)(x)) << SCG_FIRCATC4_SAMCYC_ROSC_SHIFT)) & SCG_FIRCATC4_SAMCYC_ROSC_MASK)
/*! @} */

/*! @name FIRCATC5 - FIRC Auto-trimming Counter 5 */
/*! @{ */

#define SCG_FIRCATC5_COARMINC_ROSC_MASK          (0xFFFFU)
#define SCG_FIRCATC5_COARMINC_ROSC_SHIFT         (0U)
/*! COARMINC_ROSC - Coarse Trim Minimum Counter ROSC */
#define SCG_FIRCATC5_COARMINC_ROSC(x)            (((uint32_t)(((uint32_t)(x)) << SCG_FIRCATC5_COARMINC_ROSC_SHIFT)) & SCG_FIRCATC5_COARMINC_ROSC_MASK)

#define SCG_FIRCATC5_COARMAXC_ROSC_MASK          (0xFFFF0000U)
#define SCG_FIRCATC5_COARMAXC_ROSC_SHIFT         (16U)
/*! COARMAXC_ROSC - Coarse Trim Maximum Counter ROSC */
#define SCG_FIRCATC5_COARMAXC_ROSC(x)            (((uint32_t)(((uint32_t)(x)) << SCG_FIRCATC5_COARMAXC_ROSC_SHIFT)) & SCG_FIRCATC5_COARMAXC_ROSC_MASK)
/*! @} */

/*! @name FIRCATC6 - FIRC Auto-trimming Counter 6 */
/*! @{ */

#define SCG_FIRCATC6_FINEMINC_ROSC_MASK          (0xFFFFU)
#define SCG_FIRCATC6_FINEMINC_ROSC_SHIFT         (0U)
/*! FINEMINC_ROSC - Fine Trim Minimum Counter ROSC */
#define SCG_FIRCATC6_FINEMINC_ROSC(x)            (((uint32_t)(((uint32_t)(x)) << SCG_FIRCATC6_FINEMINC_ROSC_SHIFT)) & SCG_FIRCATC6_FINEMINC_ROSC_MASK)

#define SCG_FIRCATC6_FINEMAXC_ROSC_MASK          (0xFFFF0000U)
#define SCG_FIRCATC6_FINEMAXC_ROSC_SHIFT         (16U)
/*! FINEMAXC_ROSC - Fine Trim Maximum Counter ROSC */
#define SCG_FIRCATC6_FINEMAXC_ROSC(x)            (((uint32_t)(((uint32_t)(x)) << SCG_FIRCATC6_FINEMAXC_ROSC_SHIFT)) & SCG_FIRCATC6_FINEMAXC_ROSC_MASK)
/*! @} */

/*! @name FIRCATC7 - FIRC Auto-trimming Counter 7 */
/*! @{ */

#define SCG_FIRCATC7_IDEALC_SOF_MASK             (0xFFFFFU)
#define SCG_FIRCATC7_IDEALC_SOF_SHIFT            (0U)
/*! IDEALC_SOF - Ideal Counter SOF */
#define SCG_FIRCATC7_IDEALC_SOF(x)               (((uint32_t)(((uint32_t)(x)) << SCG_FIRCATC7_IDEALC_SOF_SHIFT)) & SCG_FIRCATC7_IDEALC_SOF_MASK)

#define SCG_FIRCATC7_SETCYC_SOF_MASK             (0xF000000U)
#define SCG_FIRCATC7_SETCYC_SOF_SHIFT            (24U)
/*! SETCYC_SOF - Setup Cycle SOF */
#define SCG_FIRCATC7_SETCYC_SOF(x)               (((uint32_t)(((uint32_t)(x)) << SCG_FIRCATC7_SETCYC_SOF_SHIFT)) & SCG_FIRCATC7_SETCYC_SOF_MASK)

#define SCG_FIRCATC7_SAMCYC_SOF_MASK             (0xF0000000U)
#define SCG_FIRCATC7_SAMCYC_SOF_SHIFT            (28U)
/*! SAMCYC_SOF - Sample Cycle SOF */
#define SCG_FIRCATC7_SAMCYC_SOF(x)               (((uint32_t)(((uint32_t)(x)) << SCG_FIRCATC7_SAMCYC_SOF_SHIFT)) & SCG_FIRCATC7_SAMCYC_SOF_MASK)
/*! @} */

/*! @name FIRCATC8 - FIRC Auto-trimming Counter 8 */
/*! @{ */

#define SCG_FIRCATC8_COARMAXC_SOF_MASK           (0xFFFFFU)
#define SCG_FIRCATC8_COARMAXC_SOF_SHIFT          (0U)
/*! COARMAXC_SOF - Coarse Trim Maximum Counter SOF */
#define SCG_FIRCATC8_COARMAXC_SOF(x)             (((uint32_t)(((uint32_t)(x)) << SCG_FIRCATC8_COARMAXC_SOF_SHIFT)) & SCG_FIRCATC8_COARMAXC_SOF_MASK)
/*! @} */

/*! @name FIRCATC9 - FIRC Auto-trimming Counter 9 */
/*! @{ */

#define SCG_FIRCATC9_COARMINC_SOF_MASK           (0xFFFFFU)
#define SCG_FIRCATC9_COARMINC_SOF_SHIFT          (0U)
/*! COARMINC_SOF - Coarse Trim Minimum Counter SOF */
#define SCG_FIRCATC9_COARMINC_SOF(x)             (((uint32_t)(((uint32_t)(x)) << SCG_FIRCATC9_COARMINC_SOF_SHIFT)) & SCG_FIRCATC9_COARMINC_SOF_MASK)
/*! @} */

/*! @name FIRCATC10 - FIRC Auto-trimming Counter 10 */
/*! @{ */

#define SCG_FIRCATC10_FINEMAXC_SOF_MASK          (0xFFFFFU)
#define SCG_FIRCATC10_FINEMAXC_SOF_SHIFT         (0U)
/*! FINEMAXC_SOF - Fine Trim Maximum Counter SOF */
#define SCG_FIRCATC10_FINEMAXC_SOF(x)            (((uint32_t)(((uint32_t)(x)) << SCG_FIRCATC10_FINEMAXC_SOF_SHIFT)) & SCG_FIRCATC10_FINEMAXC_SOF_MASK)
/*! @} */

/*! @name FIRCATC11 - FIRC Auto-trimming Counter 11 */
/*! @{ */

#define SCG_FIRCATC11_FINEMINC_SOF_MASK          (0xFFFFFU)
#define SCG_FIRCATC11_FINEMINC_SOF_SHIFT         (0U)
/*! FINEMINC_SOF - Fine Trim Minimum Counter SOF */
#define SCG_FIRCATC11_FINEMINC_SOF(x)            (((uint32_t)(((uint32_t)(x)) << SCG_FIRCATC11_FINEMINC_SOF_SHIFT)) & SCG_FIRCATC11_FINEMINC_SOF_MASK)
/*! @} */

/*! @name ROSCCSR - ROSC Control Status Register */
/*! @{ */

#define SCG_ROSCCSR_LK_MASK                      (0x800000U)
#define SCG_ROSCCSR_LK_SHIFT                     (23U)
/*! LK - Lock Register
 *  0b0..Control Status Register can be written
 *  0b1..Control Status Register cannot be written
 */
#define SCG_ROSCCSR_LK(x)                        (((uint32_t)(((uint32_t)(x)) << SCG_ROSCCSR_LK_SHIFT)) & SCG_ROSCCSR_LK_MASK)

#define SCG_ROSCCSR_ROSCVLD_MASK                 (0x1000000U)
#define SCG_ROSCCSR_ROSCVLD_SHIFT                (24U)
/*! ROSCVLD - ROSC Valid
 *  0b0..ROSC is not enabled or clock is not valid
 *  0b1..ROSC is enabled and output clock is valid
 */
#define SCG_ROSCCSR_ROSCVLD(x)                   (((uint32_t)(((uint32_t)(x)) << SCG_ROSCCSR_ROSCVLD_SHIFT)) & SCG_ROSCCSR_ROSCVLD_MASK)

#define SCG_ROSCCSR_ROSCSEL_MASK                 (0x2000000U)
#define SCG_ROSCCSR_ROSCSEL_SHIFT                (25U)
/*! ROSCSEL - ROSC Selected
 *  0b0..ROSC is not the system clock source
 *  0b1..ROSC is the system clock source
 */
#define SCG_ROSCCSR_ROSCSEL(x)                   (((uint32_t)(((uint32_t)(x)) << SCG_ROSCCSR_ROSCSEL_SHIFT)) & SCG_ROSCCSR_ROSCSEL_MASK)

#define SCG_ROSCCSR_ROSCERR_MASK                 (0x4000000U)
#define SCG_ROSCCSR_ROSCERR_SHIFT                (26U)
/*! ROSCERR - ROSC Clock Error
 *  0b0..ROSC Clock has not detected an error
 *  0b1..ROSC Clock has detected an error
 */
#define SCG_ROSCCSR_ROSCERR(x)                   (((uint32_t)(((uint32_t)(x)) << SCG_ROSCCSR_ROSCERR_SHIFT)) & SCG_ROSCCSR_ROSCERR_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SCG_Register_Masks */


/*!
 * @}
 */ /* end of group SCG_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SCG_H_ */

